Tekla.Structures.Drawing.Automation.DrawingCreator
The DrawingCreator class is for handling the creation of drawings using the built-in logic of Tekla Structures.

Tekla.Structures.Drawing.Automation.DrawingCreator.CreateDrawings(Tekla.Structures.Drawing.Automation.AutoDrawingRule,System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum@)
Creates drawings using the AutoDrawing tool of Tekla Structures.
Rule: The AutoDrawing rule to be used.
aModelObjectIdentifier: The model object identifier list to be used.
Part identifiers to create single part drawings or assembly identifiers to create assembly drawings.
OperationStatus: The operation status to be used.
Returns: True on success.

Tekla.Structures.Drawing.Automation.DrawingCreator.CreateDrawings(Tekla.Structures.Drawing.Automation.AutoDrawingRule,Tekla.Structures.Identifier,Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum@)
Creates drawings using the AutoDrawing tool of Tekla Structures.
Rule: The AutoDrawing rule to be used.
ModelObjectIdentifier: The model object identifier to be used.
Part identifier to create single part drawing or assembly identifier to create assembly drawing.
OperationStatus: The operation status to be used.
Returns: True on success.

Tekla.Structures.Drawing.Automation.DrawingCreator.CreateDrawings(Tekla.Structures.Drawing.Automation.AutoDrawingRule,Tekla.Structures.Identifier)
Creates drawings using the AutoDrawing tool of Tekla Structures.
Rule: The AutoDrawing rule to be used.
ModelObjectIdentifier: The model object identifier to be used.
Part identifier to create single part drawing or assembly identifier to create assembly drawing.
Returns: True on success.